davelee98/Firmware_Unified/targets/efr32bg22-slc/opendisplay_display.cpp
static uint16_t boot_max_text_width(const char *const *lines, unsigned n, int scale)
{
  uint16_t max_w = 0u;
  unsigned i;
  for (i = 0u; i < n; i++) {
    uint16_t tw = text_width_px(lines[i], scale);
    if (tw > max_w) {
      max_w = tw;
    }
  }
  return max_w;
}

static bool boot_layout_fit(uint16_t w, uint16_t h, int scale, int pad, int qr_modules, int *module_px_out,
                            int *qr_px_out, bool *qr_right_out, int *qr_x_out, int *qr_y_out, int *avail_w_out,
                            int *text_y_out, uint16_t max_text_w)
{
  int block_h = boot_block_h(scale);
  int text_gap = pad;
  int side_gap = pad;
  int module_px;
  int qr_px;
  int min_dim = (int)((w < h) ? w : h);
  int module_ideal = (min_dim - pad * 2) / (int)qr_modules;
  if (module_ideal < 1) {
    module_ideal = 1;
  }
  if (module_ideal > 6) {
    module_ideal = 6;
  }

  for (module_px = module_ideal; module_px >= 1; module_px--) {
    qr_px = module_px * (int)qr_modules;
    if (qr_px > (int)w - pad * 2) {
      continue;
    }
    if ((int)w >= pad * 2 + (int)max_text_w + side_gap + qr_px
        && (int)h >= pad * 2 + (block_h > qr_px ? block_h : qr_px)) {
      int avail_w = (int)w - pad * 2 - qr_px - side_gap;
      if ((int)max_text_w <= avail_w) {
        int qr_x = (int)w - pad - qr_px;
        int qr_y = pad;
        int text_y = pad;
        if (block_h < qr_px) {
          text_y = pad + (qr_px - block_h) / 2;
        }
        *module_px_out = module_px;
        *qr_px_out = qr_px;
        *qr_right_out = true;
        *qr_x_out = qr_x;
        *qr_y_out = qr_y;
        *avail_w_out = avail_w;
        *text_y_out = text_y;
        return true;
      }
    }
    if ((int)w >= pad * 2 + (int)max_text_w && (int)h >= pad * 2 + block_h + text_gap + qr_px) {
      *module_px_out = module_px;
      *qr_px_out = qr_px;
      *qr_right_out = false;
      *qr_x_out = ((int)w - qr_px) / 2;
      *qr_y_out = (int)h - pad - qr_px;
      *avail_w_out = (int)w - pad * 2;
      *text_y_out = pad;
      return true;
    }
  }
  return false;
}

static void bytes_to_hex(const uint8_t *in, uint16_t len, char *out, uint16_t out_size)
{
  static const char *H = "0123456789ABCDEF";
  uint16_t i;
  if (out == nullptr || out_size < (uint16_t)(len * 2u + 1u)) {
    return;
  }
  for (i = 0; i < len; i++) {
    out[i * 2u + 0u] = H[(in[i] >> 4) & 0x0Fu];
    out[i * 2u + 1u] = H[in[i] & 0x0Fu];
  }
  out[len * 2u] = '\0';
}

static uint16_t base64url_encode(const uint8_t *data, uint16_t len, char *out, uint16_t out_size)
{
  static const char tbl[] = "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789-_";
  uint16_t out_len = 0;
  uint16_t i = 0;
  while (i + 3u <= len) {
    uint32_t v = ((uint32_t)data[i] << 16) | ((uint32_t)data[i + 1u] << 8) | data[i + 2u];
    i += 3u;
    if (out_len + 4u >= out_size) {
      return 0u;
    }
    out[out_len++] = tbl[(v >> 18) & 63u];
    out[out_len++] = tbl[(v >> 12) & 63u];
    out[out_len++] = tbl[(v >> 6) & 63u];
    out[out_len++] = tbl[v & 63u];
  }
  if ((len - i) == 1u) {
    uint32_t v = ((uint32_t)data[i] << 16);
    if (out_len + 2u >= out_size) {
      return 0u;
    }
    out[out_len++] = tbl[(v >> 18) & 63u];
    out[out_len++] = tbl[(v >> 12) & 63u];
  } else if ((len - i) == 2u) {
    uint32_t v = ((uint32_t)data[i] << 16) | ((uint32_t)data[i + 1u] << 8);
    if (out_len + 3u >= out_size) {
      return 0u;
    }
    out[out_len++] = tbl[(v >> 18) & 63u];
    out[out_len++] = tbl[(v >> 12) & 63u];
    out[out_len++] = tbl[(v >> 6) & 63u];
  }
  if (out_len >= out_size) {
    return 0u;
  }
  out[out_len] = '\0';
  return out_len;
}

static bool render_boot_screen(BBEPDISP &epd, const struct GlobalConfig *cfg)
{
  static const char *LANDING_URL_PREFIX = "https://opendisplay.org/l/?";
  const struct SecurityConfig *sec = od_get_parsed_security();
  const struct DisplayConfig *dc;
  uint16_t w, h, tag_type, mfg;
  uint64_t uid;
  uint32_t last3;
  uint8_t payload[23];
  uint8_t key[16];
  char payload_b64[64];
  char url[128];
  QRCode qr;
  static uint8_t qr_buf[256];
  uint16_t qr_buf_size;
  uint8_t qr_size;
  uint16_t qr_modules;
  int scale_text;
  int pad;
  int module_px;
  int qr_px;
  bool qr_right;
  int qr_x, qr_y, avail_w, text_y;
  char name_line[16];
  char fw_line[20];
  const char *domain_line = "OPENDISPLAY.ORG";
  char key_hex[33];
  char k1[17], k2[17];
  uint16_t dW, nW, fwW, k1W, k2W;

  if (cfg == nullptr || cfg->display_count == 0u) {
    return false;
  }
  dc = &cfg->displays[0];
  w = (uint16_t)epd.width;
  h = (uint16_t)epd.height;

  memset(payload, 0, sizeof(payload));
  tag_type = dc->legacy_tag_type;
  payload[0] = (uint8_t)((tag_type >> 8) & 0xFFu);
  payload[1] = (uint8_t)(tag_type & 0xFFu);
  uid = SYSTEM_GetUnique();
  last3 = (uint32_t)(uid & 0xFFFFFFu);
  payload[2] = (uint8_t)((last3 >> 16) & 0xFFu);
  payload[3] = (uint8_t)((last3 >> 8) & 0xFFu);
  payload[4] = (uint8_t)(last3 & 0xFFu);
  memset(key, 0, sizeof(key));
  if (sec != nullptr && (sec->flags & SECURITY_FLAG_SHOW_KEY_ON_SCREEN) != 0u) {
    memcpy(key, sec->encryption_key, sizeof(key));
  }
  memcpy(&payload[5], key, sizeof(key));
  mfg = cfg->manufacturer_data.manufacturer_id;
  payload[21] = (uint8_t)((mfg >> 8) & 0xFFu);
  payload[22] = (uint8_t)(mfg & 0xFFu);

  if (base64url_encode(payload, sizeof(payload), payload_b64, sizeof(payload_b64)) == 0u) {
    return false;
  }
  (void)snprintf(url, sizeof(url), "%s%s", LANDING_URL_PREFIX, payload_b64);

  qr_buf_size = qrcode_getBufferSize(6u);
  if (qr_buf_size == 0u || qr_buf_size > sizeof(qr_buf)) {
    return false;
  }
  if (qrcode_initText(&qr, qr_buf, 6u, ECC_MEDIUM, url) != 0) {
    return false;
  }
  qr_size = qr.size;
  qr_modules = (uint16_t)(qr_size + 8u);

  (void)snprintf(name_line, sizeof(name_line), "OD%06lX", (unsigned long)last3);
  {
    uint16_t ver = opendisplay_ble_get_app_version();
    (void)snprintf(fw_line, sizeof(fw_line), "FW:S %u.%u.%u",
                   (unsigned)((ver >> 8) & 0xFFu), (unsigned)(ver & 0xFFu),
                   (unsigned)opendisplay_ble_get_app_version_patch());
  }
  bytes_to_hex(key, sizeof(key), key_hex, sizeof(key_hex));
  memcpy(k1, key_hex, 16);
  k1[16] = '\0';
  memcpy(k2, key_hex + 16, 16);
  k2[16] = '\0';

  {
    static const char *boot_lines[] = {
      domain_line, name_line, fw_line, k1, k2,
    };
    uint16_t max_text_w;
    bool layout_ok = false;
    int try_scale;

