davelee98/Firmware_Unified/targets/efr32bg22-slc/opendisplay_display.cpp
    for (try_scale = (w >= 400u && h >= 300u) ? 2 : 1; try_scale >= 1 && !layout_ok; try_scale--) {
      scale_text = try_scale;
      pad = 6 * scale_text;
      max_text_w = boot_max_text_width(boot_lines, 5u, scale_text);
      layout_ok = boot_layout_fit(w, h, scale_text, pad, (int)qr_modules, &module_px, &qr_px, &qr_right, &qr_x,
                                  &qr_y, &avail_w, &text_y, max_text_w);
    }
    if (!layout_ok) {
      scale_text = 1;
      pad = 6;
      max_text_w = boot_max_text_width(boot_lines, 5u, scale_text);
      module_px = 1;
      qr_px = module_px * (int)qr_modules;
      qr_right = false;
      qr_x = ((int)w - qr_px) / 2;
      qr_y = (int)h - pad - qr_px;
      if (qr_y < pad) {
        qr_y = pad;
      }
      avail_w = (int)w - pad * 2;
      text_y = pad;
    }
  }

  {
    static uint8_t s_boot_row[256];
    bool is4clr = (epd.iFlags & BBEP_4COLOR) != 0;
    bool is3clr = (epd.iFlags & BBEP_3COLOR) != 0;
    int pitch = is4clr ? ((int)w + 3) / 4 : ((int)w + 7) / 8;
    uint8_t white_byte = is4clr ? 0x55u : 0xFFu;
    int domX, nameX, fwX, k1X, k2X, y;
    int text_max_x;
    int text_origin_x;

    dW  = text_width_px(domain_line, scale_text);
    nW  = text_width_px(name_line, scale_text);
    fwW = text_width_px(fw_line, scale_text);
    k1W = text_width_px(k1, scale_text);
    k2W = text_width_px(k2, scale_text);
    text_origin_x = qr_right ? pad : ((int)w - (int)avail_w) / 2;
    if (text_origin_x < pad) {
      text_origin_x = pad;
    }
    text_max_x = qr_right ? (qr_x - pad) : (int)w;
    domX  = text_origin_x + ((avail_w - (int)dW)  / 2);
    nameX = text_origin_x + ((avail_w - (int)nW)  / 2);
    fwX   = text_origin_x + ((avail_w - (int)fwW) / 2);
    k1X   = text_origin_x + ((avail_w - (int)k1W) / 2);
    k2X   = text_origin_x + ((avail_w - (int)k2W) / 2);
    if (domX < pad) {
      domX = pad;
    }
    if (nameX < pad) {
      nameX = pad;
    }
    if (fwX < pad) {
      fwX = pad;
    }
    if (k1X < pad) {
      k1X = pad;
    }
    if (k2X < pad) {
      k2X = pad;
    }

    bbepSetAddrWindow(&epd, 0, 0, (int)w, (int)h);
    bbepStartWrite(&epd, is4clr ? PLANE_1 : PLANE_0);

    for (y = 0; y < (int)h; y++) {
      memset(s_boot_row, white_byte, (size_t)pitch);

      draw_text_row(s_boot_row, y, domX,  text_y,                      domain_line, scale_text, is4clr, text_max_x);
      draw_text_row(s_boot_row, y, nameX, text_y + boot_line_step(scale_text), name_line, scale_text, is4clr,
                    text_max_x);
      draw_text_row(s_boot_row, y, fwX,   text_y + boot_line_step(scale_text) * 2, fw_line, scale_text, is4clr,
                    text_max_x);
      draw_text_row(s_boot_row, y, k1X,   text_y + boot_line_step(scale_text) * 3, k1, scale_text, is4clr, text_max_x);
      draw_text_row(s_boot_row, y, k2X,   text_y + boot_line_step(scale_text) * 4, k2, scale_text, is4clr, text_max_x);

      if (y >= qr_y && y < qr_y + qr_px) {
        int local_y = y - qr_y;
        int my = local_y / module_px;
        if (my < (int)qr_modules) {
          int qy_qr = my - 4;
          int mx;
          for (mx = 0; mx < (int)qr_modules; mx++) {
            int qx_qr = mx - 4;
            bool on = false;
            if (qx_qr >= 0 && qy_qr >= 0 && qx_qr < (int)qr_size && qy_qr < (int)qr_size) {
              on = qrcode_getModule(&qr, (uint8_t)qx_qr, (uint8_t)qy_qr);
            }
            if (!on) {
              continue;
            }
            {
              int px0 = qr_x + mx * module_px;
              int sx;
              for (sx = 0; sx < module_px; sx++) {
                int px = px0 + sx;
                if (px >= 0 && px < (int)w) {
                  set_pixel_row(s_boot_row, px, is4clr);
                }
              }
            }
          }
        }
      }

      bbepWriteData(&epd, s_boot_row, pitch);
    }
    if (is3clr) {
      bbepStartWrite(&epd, PLANE_1);
      for (y = 0; y < (int)h; y++) {
        memset(s_boot_row, 0x00u, (size_t)pitch);
        bbepWriteData(&epd, s_boot_row, pitch);
      }
    }
  }
  return true;
}

static bool wait_for_refresh(uint32_t timeout_ms)
{
  uint32_t elapsed = 0;
  bool saw_busy = false;
  while (elapsed < timeout_ms) {
    bool busy = bbepIsBusy(&s_epd);
    if (busy) {
      saw_busy = true;
    } else if (saw_busy) {
      return true;
    }
    sl_sleeptimer_delay_millisecond(50);
    elapsed += 50;
  }
  return saw_busy && !bbepIsBusy(&s_epd);
}

extern "C" void opendisplay_display_abort(void)
{
  if (s_active) {
    bbepSleep(&s_epd, DEEP_SLEEP);
  }
  display_power_set(false);
  s_active = false;
  s_total_bytes = 0;
  s_written_bytes = 0;
  s_dw_chunk_n = 0;
  s_dw_log_pct = 0;
  s_dw_trailing_ignores = 0;
  s_plane_size = 0;
  s_plane2_started = false;
  s_dw_compressed = false;
  s_dw_decompressed_total = 0;
}

static void dw_log_progress(void)
{
  if (s_total_bytes == 0u) {
    return;
  }
  uint8_t pct = (uint8_t)((100u * s_written_bytes) / s_total_bytes);
  if (pct >= s_dw_log_pct + 25u) {
    printf("[OD] dw data #%lu %lu/%lu B (%u%%)%s\r\n", (unsigned long)s_dw_chunk_n,
           (unsigned long)s_written_bytes, (unsigned long)s_total_bytes, (unsigned)pct,
           s_dw_compressed ? " zlib" : "");
    s_dw_log_pct = (pct / 25u) * 25u;
  }
}

static int dw_stream_raw_bytes(const uint8_t *payload, uint32_t payload_len)
{
  uint32_t remaining = (s_written_bytes < s_total_bytes) ? (s_total_bytes - s_written_bytes) : 0u;
  const bool bitplanes = opendisplay_color_is_bitplanes(s_color_scheme);
  const uint8_t *p = payload;
  uint32_t left = payload_len;
  const uint32_t written_before = s_written_bytes;

  while (left > 0u && remaining > 0u) {
    uint32_t rem = remaining;
    uint32_t chunk = left;
    if (bitplanes && !s_plane2_started && s_plane_size > 0u) {
      uint32_t to_plane_end = s_plane_size - s_written_bytes;
      if (chunk > to_plane_end) {
        chunk = to_plane_end;
      }
    }
    if (chunk > rem) {
      chunk = rem;
    }
    if (chunk == 0u) {
      break;
    }
    bbepWriteData(&s_epd, (uint8_t *)(void *)p, (int)chunk);
    p += chunk;
    left -= chunk;
    s_written_bytes += chunk;
    remaining -= chunk;
    if (bitplanes && !s_plane2_started && s_plane_size > 0u && s_written_bytes >= s_plane_size) {
      bbepStartWrite(&s_epd, PLANE_1);
      s_plane2_started = true;
    }
  }

  if (s_written_bytes > written_before) {
    dw_log_progress();
  }
  return 0;
}

static bool zlib_stream_to_direct_write(const uint8_t *data, uint32_t len, bool final)
{
  od_zlib_status_t status = od_zlib_stream_push(data, len, final);
  if (status == OD_ZLIB_STATUS_ERROR) {
    printf("[OD] zlib push error: %s\r\n", od_zlib_stream_error());
    return false;
  }

