davelee98/Firmware_Unified/targets/efr32bg22-slc/opendisplay_display.cpp
  for (;;) {
    size_t bytes_out = 0;
    status = od_zlib_stream_poll(s_decompression_chunk, OPENDISPLAY_DECOMPRESSION_CHUNK_SIZE, &bytes_out);
    if (bytes_out > 0u) {
      uint32_t before = s_written_bytes;
      if (dw_stream_raw_bytes(s_decompression_chunk, (uint32_t)bytes_out) != 0) {
        return false;
      }
      if (s_written_bytes - before != (uint32_t)bytes_out) {
        return false;
      }
      if (s_written_bytes > s_dw_decompressed_total) {
        return false;
      }
    }
    if (status == OD_ZLIB_STATUS_OUTPUT_READY) {
      continue;
    }
    if (status == OD_ZLIB_STATUS_NEEDS_INPUT) {
      return !final;
    }
    if (status == OD_ZLIB_STATUS_DONE) {
      return s_written_bytes == s_dw_decompressed_total;
    }
    printf("[OD] zlib poll error: %s\r\n", od_zlib_stream_error());
    return false;
  }
}

extern "C" void opendisplay_display_boot_apply(void)
{
  const struct DisplayConfig *d = display_cfg();
  int panel;
  if (s_boot_applied || d == nullptr) {
    return;
  }
  s_boot_applied = true;
  panel = opendisplay_map_epd(d->panel_ic_type);
  if (panel == EP_PANEL_UNDEFINED) {
    return;
  }
  memset(&s_epd, 0, sizeof(s_epd));
  display_power_set(true);
  if (bbepSetPanelType(&s_epd, panel) != BBEP_SUCCESS) {
    display_power_set(false);
    return;
  }
  bbepSetRotation(&s_epd, (int)d->rotation * 90);
  bbepInitIO(&s_epd, d->dc_pin, d->reset_pin, d->busy_pin, d->cs_pin, d->data_pin, d->clk_pin, 0);
  od_bbep_wake(&s_epd);
  od_bbep_send_panel_init_full(&s_epd);
  if (!render_boot_screen(s_epd, opendisplay_get_global_config())) {
    bbepFill(&s_epd, BBEP_WHITE, PLANE_DUPLICATE);
  }
  /* The class's refresh(mode, bWait=true) called bbepWaitBusy() itself after a successful
     * refresh; the bare function does not. Written out explicitly -- dropping it would let boot
     * proceed while the panel was still refreshing. */
  if (bbepRefresh(&s_epd, REFRESH_FULL) == BBEP_SUCCESS) {
    bbepWaitBusy(&s_epd);
  }
  bbepSleep(&s_epd, DEEP_SLEEP);
  display_power_set(false);
}

extern "C" int opendisplay_display_direct_write_start(const uint8_t *payload, uint16_t payload_len)
{
  s_dw_init_t0 = sl_sleeptimer_get_tick_count();
  printf("[OD] dw init begin\r\n");

  const struct DisplayConfig *d = display_cfg();
  if (d == nullptr) {
    printf("[OD] dw start err no display cfg\r\n");
    return -1;
  }
  dw_init_mark("after cfg");

  int panel = opendisplay_map_epd(d->panel_ic_type);
  if (panel == EP_PANEL_UNDEFINED) {
    printf("[OD] dw start err bad panel_ic_type=%u\r\n", (unsigned)d->panel_ic_type);
    return -2;
  }

  opendisplay_display_abort();
  dw_init_mark("after abort");
  display_power_set(true);
  memset(&s_epd, 0, sizeof(s_epd));
  if (bbepSetPanelType(&s_epd, panel) != BBEP_SUCCESS) {
    printf("[OD] dw start err setPanelType panel=%d\r\n", panel);
    display_power_set(false);
    return -3;
  }
  dw_init_mark("after setPanelType");

  bbepSetRotation(&s_epd, (int)d->rotation * 90);
  bbepInitIO(&s_epd, d->dc_pin, d->reset_pin, d->busy_pin, d->cs_pin, d->data_pin, d->clk_pin, 0);
  dw_init_mark("after initIO");
  od_bbep_wake(&s_epd);
  dw_init_mark("after wake (reset + busy)");
  od_bbep_send_panel_init_full(&s_epd);
  dw_init_mark("after pInitFull");
  bbepSetAddrWindow(&s_epd, 0, 0, d->pixel_width, d->pixel_height);
  dw_init_mark("after setAddrWindow");

  s_color_scheme = d->color_scheme;
  s_plane_size = 0;
  s_plane2_started = false;
  if (opendisplay_color_is_bitplanes(s_color_scheme)) {
    s_plane_size = opendisplay_color_bitplane_plane_bytes(d->pixel_width, d->pixel_height);
  }
  s_total_bytes =
    opendisplay_color_direct_write_total_bytes(d->pixel_width, d->pixel_height, s_color_scheme);
  {
    int sp = opendisplay_color_start_plane(s_color_scheme);
    bbepStartWrite(&s_epd, sp == 0 ? PLANE_0 : PLANE_1);
  }
  dw_init_mark("after startWrite");

  s_written_bytes = 0;
  s_dw_chunk_n = 0;
  s_dw_log_pct = 0;
  s_dw_trailing_ignores = 0;
  s_dw_compressed = (payload != nullptr && payload_len >= 4u);
  s_dw_decompressed_total = 0;
  s_active = true;

  if (s_dw_compressed) {
    /* ZIP (0x02) and/or streaming_decompression / ZIPXL (0x01): both mean
     * streaming zlib inflate. Post-2.0 configs may set only bit 0. */
    if ((d->transmission_modes & (TRANSMISSION_MODE_ZIP | TRANSMISSION_MODE_ZIPXL)) == 0u) {
      printf("[OD] dw start err compression not enabled in transmission_modes\r\n");
      opendisplay_display_abort();
      return -4;
    }
    s_dw_decompressed_total =
      (uint32_t)payload[0]
      | ((uint32_t)payload[1] << 8)
      | ((uint32_t)payload[2] << 16)
      | ((uint32_t)payload[3] << 24);
    if (s_dw_decompressed_total != s_total_bytes) {
      printf("[OD] dw start err zlib size %lu != %lu\r\n",
             (unsigned long)s_dw_decompressed_total, (unsigned long)s_total_bytes);
      opendisplay_display_abort();
      return -5;
    }
    od_zlib_stream_reset(s_dw_decompressed_total);
    if (payload_len > 4u) {
      if (!zlib_stream_to_direct_write(payload + 4, (uint32_t)payload_len - 4u, false)) {
        opendisplay_display_abort();
        return -6;
      }
    }
  } else if (payload_len != 0u) {
    printf("[OD] dw start note non-empty payload len=%u (ignored)\r\n", (unsigned)payload_len);
  }

  printf("[OD] dw start total=%lu B bpp=%d cs=%u panel=%u %ux%u bitplanes=%d%s\r\n",
         (unsigned long)s_total_bytes, opendisplay_color_bits_per_pixel(s_color_scheme),
         (unsigned)s_color_scheme, (unsigned)d->panel_ic_type, (unsigned)d->pixel_width,
         (unsigned)d->pixel_height, (int)opendisplay_color_is_bitplanes(s_color_scheme),
         s_dw_compressed ? " zlib" : "");
  return 0;
}

extern "C" int opendisplay_display_direct_write_data(const uint8_t *payload, uint16_t payload_len)
{
  if (!s_active || payload == nullptr || payload_len == 0u) {
    printf("[OD] dw data bad arg active=%d len=%u\r\n", (int)s_active, (unsigned)payload_len);
    return -1;
  }

  if (s_dw_compressed) {
    const uint32_t written_before = s_written_bytes;
    if (!zlib_stream_to_direct_write(payload, payload_len, false)) {
      return -3;
    }
    if (s_written_bytes > written_before) {
      s_dw_chunk_n++;
    }
    return 0;
  }

  uint32_t remaining = (s_written_bytes < s_total_bytes) ? (s_total_bytes - s_written_bytes) : 0u;
  if (remaining == 0u) {
    if (payload_len > 0u) {
      if (s_dw_trailing_ignores < 4u) {
        printf("[OD] dw data ignore trailing chunk #%u len=%u (have %lu/%lu B)\r\n",
               (unsigned)s_dw_trailing_ignores + 1u, (unsigned)payload_len,
               (unsigned long)s_written_bytes, (unsigned long)s_total_bytes);
        s_dw_trailing_ignores++;
      }
    }
    return 0;
  }

