davelee98/Firmware_Unified/targets/efr32bg22-slc/opendisplay_display.cpp
  const uint32_t written_before = s_written_bytes;
  if (dw_stream_raw_bytes(payload, payload_len) != 0) {
    return -2;
  }
  if (s_written_bytes > written_before) {
    s_dw_chunk_n++;
  }
  return 0;
}

static int s_dw_refresh_mode = REFRESH_FULL;

extern "C" int opendisplay_display_direct_write_end_prepare(const uint8_t *payload,
                                                              uint16_t payload_len)
{
  if (!s_active) {
    printf("[OD] dw end err inactive\r\n");
    return -1;
  }
  if (s_dw_compressed) {
    if (!zlib_stream_to_direct_write(nullptr, 0, true)) {
      printf("[OD] dw end err zlib finalize\r\n");
      return -3;
    }
  }
  if (s_written_bytes < s_total_bytes) {
    printf("[OD] dw end err incomplete wr=%lu need=%lu\r\n", (unsigned long)s_written_bytes,
         (unsigned long)s_total_bytes);
    return -2;
  }
  s_dw_refresh_mode = REFRESH_FULL;
  if (payload != nullptr && payload_len >= 1u && payload[0] == 1u) {
    s_dw_refresh_mode = REFRESH_FAST;
  }
  return 0;
}

extern "C" int opendisplay_display_direct_write_end_refresh(bool *refresh_ok)
{
  if (!s_active) {
    return -1;
  }
  if (refresh_ok != nullptr) {
    *refresh_ok = false;
  }

  printf("[OD] dw refresh start mode=%d\r\n", s_dw_refresh_mode);
  (void)bbepRefresh(&s_epd, s_dw_refresh_mode);
  bool ok = wait_for_refresh(60000u);
  printf("[OD] dw refresh done ok=%d busy=%d\r\n", (int)ok, (int)bbepIsBusy(&s_epd));
  bbepSleep(&s_epd, DEEP_SLEEP);
  s_active = false;
  s_dw_compressed = false;
  s_dw_decompressed_total = 0;
  display_power_set(false);

  if (refresh_ok != nullptr) {
    *refresh_ok = ok;
  }
  return 0;
}

extern "C" int opendisplay_display_direct_write_end(const uint8_t *payload,
                                                      uint16_t payload_len,
                                                      bool *refresh_ok)
{
  int rc = opendisplay_display_direct_write_end_prepare(payload, payload_len);
  return rc == 0 ? opendisplay_display_direct_write_end_refresh(refresh_ok) : rc;
}
